H4W9/ESP32_FlipWorld/ESP32_FlipWorld.ino
// About — app name/version/author, hardware + build detail rows, credits.
static void aboutScreen() {
  tft->fillScreen(COL_BG);
  drawHeader("About", true);

  // Compact spacing so the whole page fits above the "tap to go back" line on the
  // shorter V8 panel (240x320); the Pancake keeps its original roomier layout.
#ifdef MARAUDER_V8
  const int dName = 26, dSub = 17, dAuth = 18, dRule = 6, dRow = 17, dGap = 2, dRule2 = 6, dCred = 16;
  const int valX = 82;   // value column; keeps "XPT2046 resistive" inside 240 px
  const char *credit1 = "Game by JBlanked";
  const char *credit2 = "Picoware engine";
#else
  const int dName = 32, dSub = 22, dAuth = 24, dRule = 10, dRow = 21, dGap = 4, dRule2 = 8, dCred = 20;
  const int valX = 110;
  const char *credit1 = "FlipWorld game by JBlanked";
  const char *credit2 = "jblanked.com/flipper  -  Picoware";
#endif

  int cx = SCRW / 2, y = CONTENTY + 12;

  // Name + version + author (centred, prominent).
  tft->setTextColor(COL_FG, COL_BG);
  tft->setTextDatum(MC_DATUM);
  tft->drawString(FW_NAME, cx, y, 4); y += dName;
  tft->drawString(String("Version ") + FW_VERSION, cx, y, 2); y += dSub;
  tft->setTextColor(COL_DIM, COL_BG);
  tft->drawString("UI by " FW_AUTHOR, cx, y, 2); y += dAuth;
  tft->drawFastHLine(16, y, SCRW - 32, theme.neon(1, theme.edge())); y += dRule;

  // Label : value detail rows.
  tft->setTextDatum(TL_DATUM);
  auto row = [&](const char *label, const String &value) {
    tft->setTextColor(COL_DIM, COL_BG); tft->drawString(label, 16, y, 2);
    tft->setTextColor(COL_FG, COL_BG);  tft->drawString(value, valX, y, 2);
    y += dRow;
  };
  row("Board",   BOARD_NAME);
  row("MCU",     BOARD_MCU);
  row("Display", BOARD_DISPLAY);
  row("Touch",   BOARD_TOUCH);
  // Actual PSRAM size (0 if absent or init failed), rounded to whole MB.
  {
    size_t ps = ESP.getPsramSize();
    if (ps >= 1024 * 1024)  row("PSRAM", String((unsigned)((ps + 512 * 1024) / (1024 * 1024))) + " MB");
    else if (ps > 0)        row("PSRAM", String((unsigned)(ps / 1024)) + " KB");
    else                    row("PSRAM", "None");
  }
  row("Built",   __DATE__);
  row("Commit",  FW_COMMIT);

  y += dGap;
  tft->drawFastHLine(16, y, SCRW - 32, theme.neon(2, theme.edge())); y += dRule2;
  tft->setTextColor(COL_DIM, COL_BG);
  tft->drawString(credit1, 16, y, 2); y += dCred;
  tft->drawString(credit2, 16, y, 2);

  statusLine("Tap to go back.", COL_DIM);
  uint16_t x, ty; waitTap(x, ty);
}

static void settingsFlow() {
  int sel = -1;
  auto full = [&]() {                         // full repaint (theme/bg changed)
    tft->fillScreen(COL_BG);
    drawHeader("Settings", true);
    for (int i = 0; i < SET_N; i++) drawSettingRow(i, sel);
  };
  auto recolor = [&]() {                      // font colour changed — no fillScreen
    drawHeader("Settings", true);
    for (int i = 0; i < SET_N; i++) drawSettingRow(i, sel);
  };
  full();

  for (;;) {
    uint16_t x, y;
    if (!waitTap(x, y)) continue;
    if (backTapped(x, y)) { ledOff(); return; }     // clear any LED preview on exit
    if ((int)y < CONTENTY) continue;
    int row = ((int)y - CONTENTY) / ITEMH;
    if (row < 0 || row >= SET_N) continue;

    // Move the highlight to the tapped row (partial redraw of old + new).
    int old = sel; sel = row;
    if (old != row) { if (old >= 0) drawSettingRow(old, sel); drawSettingRow(row, sel); }
    if (row != 4) ledOff();                         // LED preview only while on the LED row

    int h = (row <= 4) ? chipHit(CONTENTY + row * ITEMH, setChipVal(row), x, y) : -1;
    switch (row) {
      case 0: if (h >= 0) { theme.cycleTheme(h); theme.save(); applyThemeToViewManager(); full(); } break;
      case 1: if (h >= 0) { theme.cycleAccent(h); theme.save(); applyThemeToViewManager(); drawSettingRow(1, sel); } break;
      case 2: if (h >= 0) { theme.cycleFontCol(h); theme.save(); applyThemeToViewManager(); recolor(); } break;
      case 3: if (h == 0 && theme.bright > 0)  theme.bright--;
              else if (h == 1 && theme.bright < 19) theme.bright++;
              if (h >= 0) { theme.save(); applyBrightness(); drawSettingRow(3, sel); } break;
      case 4: if (h == 0 && theme.led_bright > 0)  theme.led_bright--;
              else if (h == 1 && theme.led_bright < 20) theme.led_bright++;
              if (h >= 0) { theme.save(); drawSettingRow(4, sel); }
              ledWifi(); break;                     // live preview at the new brightness
      case 5: wifiSetup(); full(); break;
      case 6: wifiDebug(); full(); break;
      case 7: { char b[64] = {0}; String u = credGet("user"); strncpy(b, u.c_str(), sizeof(b) - 1);
                if (touchKeyboardInput(*tft, COL_FG, COL_BG, b, sizeof(b), "FlipWorld User:", false))
                  credSet("user", String(b));
                full(); } break;
      case 8: { char b[64] = {0}; String p = credGet("pass"); strncpy(b, p.c_str(), sizeof(b) - 1);
                if (touchKeyboardInput(*tft, COL_FG, COL_BG, b, sizeof(b), "FlipWorld Password:", true))
                  credSet("pass", String(b));
                full(); } break;
      case 9: aboutScreen(); full(); break;
#ifndef HAS_CAP_TOUCH
      case 10: touchCalRun(); full(); break;   // resistive drifts — allow a redo
#endif
      default: break;
    }
  }
}


// ═════════════════════════════════════════════════════════════════════════════
//  FlipWorld — top-down action game ported from Picoware (jblanked/FlipWorld).
//  Rendered in full colour: the original 1-bit Flipper sprites are blitted per
//  entity in their own ink colour over a coloured world (see Draw::imageMaskPGM
//  and the ink_color assignments in the flipworld/ engine files).
//
//  This shell is touch-only, so the game is driven through the same tap-zones the
//  rest of the UI uses (InputManager maps screen edges to BUTTON_UP/DOWN/LEFT/
//  RIGHT and the centre to BUTTON_CENTER). Input is reported continuously while
//  the panel is held, so:
//    • hold the top / bottom / left / right edge → move continuously
//    • hold the centre                           → attack
//    • tap the header Back button (top-left)     → exit to the menu
// ═════════════════════════════════════════════════════════════════════════════

