H4W9/ESP32_FlipWorld/ESP32_FlipWorld.ino
// The world background is solid black; sprites are drawn over it in full colour.
static const uint16_t FW_WORLD_BG = TFT_BLACK;

// ── FlipWorld progression (SD-persisted, online-authoritative) ────────────────
// Player stats live on SD at /flipworld_stats.json so the game plays fully
// offline. When signed in (Settings → Username/Password) AND WiFi is up, we pull
// the server copy at game start and OVERWRITE the SD file with it — online is the
// source of truth. On exit we save back to SD and, if online, push to the server
// so it stays the master for next time. Same jblanked.com account as FlipSocial.
static const char *FW_STATS_FILE = "/flipworld_stats.json";
static const char *FW_API        = "https://www.jblanked.com/flipper/api/user/";

static bool fwOnline() { return WiFi.status() == WL_CONNECTED && credGet("user").length() > 0; }

static Entity *fwFindPlayer(Level *level) {
  for (int i = 0; i < level->getEntityCount(); i++) {
    Entity *e = level->getEntity(i);
    if (e && e->type == ENTITY_PLAYER) return e;
  }
  return nullptr;
}

// Fill s from a {"game_stats":{...}} JSON document (server or SD file share it).
static bool fwStatsFromDoc(JsonDocument &d, const String &fallbackName, FWStats &s) {
  JsonObject g = d["game_stats"];
  if (g.isNull()) return false;
  s.name       = g["username"]   | fallbackName;
  s.level      = g["level"]      | 1.0f;
  s.xp         = g["xp"]         | 0.0f;
  s.health     = g["health"]     | 100.0f;
  s.max_health = g["max_health"] | 100.0f;
  s.strength   = g["strength"]   | 10.0f;
  s.valid = true;
  return true;
}

static bool fwStatsReadSD(FWStats &s) {
  s.valid = false;
  File f = SD.open(FW_STATS_FILE, FILE_READ);
  if (!f) return false;
  JsonDocument d;
  DeserializationError e = deserializeJson(d, f);
  f.close();
  if (e) return false;
  return fwStatsFromDoc(d, "Player", s);
}

static void fwStatsWriteSD(const FWStats &s) {
  JsonDocument d;
  JsonObject g = d["game_stats"].to<JsonObject>();
  g["username"]   = s.name;
  g["level"]      = (int)s.level;
  g["xp"]         = (long)s.xp;
  g["health"]     = (int)s.health;
  g["max_health"] = (int)s.max_health;
  g["strength"]   = s.strength;
  SD.remove(FW_STATS_FILE);                 // truncate: FILE_WRITE won't shrink a file
  File f = SD.open(FW_STATS_FILE, FILE_WRITE);
  if (!f) return;
  serializeJson(d, f);
  f.close();
}

// GET /game-stats/{user}/ → overwrite s. Blocks on the TLS request.
static bool fwStatsFetchOnline(FWStats &s) {
  s.valid = false;
  String user = credGet("user"), pass = credGet("pass");
  if (user.length() == 0) return false;
  HTTP http;
  const char *hk[] = {"Content-Type", "Username", "Password"};
  const char *hv[] = {"application/json", user.c_str(), pass.c_str()};
  ledHttp();
  String r = http.request("GET", String(FW_API) + "game-stats/" + user + "/", "", hk, hv, 3);
  ledOff();
  if (r.length() == 0) return false;
  JsonDocument d;
  if (deserializeJson(d, r)) return false;
  return fwStatsFromDoc(d, user, s);
}

// POST /update-game-stats/ with the current progression (best-effort).
static void fwStatsPushOnline(const FWStats &s) {
  String user = credGet("user"), pass = credGet("pass");
  if (user.length() == 0) return;
  JsonDocument d;
  d["username"] = user;
  JsonObject g = d["game_stats"].to<JsonObject>();
  g["username"]   = user;
  g["level"]      = (int)s.level;
  g["xp"]         = (long)s.xp;
  g["health"]     = (int)s.health;
  g["max_health"] = (int)s.max_health;
  g["strength"]   = s.strength;
  String payload; serializeJson(d, payload);
  HTTP http;
  const char *hk[] = {"Content-Type", "Username", "Password"};
  const char *hv[] = {"application/json", user.c_str(), pass.c_str()};
  ledHttp();
  http.request("POST", String(FW_API) + "update-game-stats/", payload, hk, hv, 3);
  ledOff();
}

// After player_spawn: load progression and apply. When onlineSync is true and we're
// online, the server copy is pulled and overwrites SD (authoritative start); later
// campaign maps read the SD copy the previous map wrote.
static void flipWorldStatsApply(Level *level, bool onlineSync = true) {
  Entity *p = fwFindPlayer(level);
  if (!p) return;
  FWStats s; s.valid = false;
  if (onlineSync && fwOnline()) {
    tft->setTextDatum(MC_DATUM);
    tft->setTextColor(COL_FG, COL_BG);
    tft->drawString("Syncing stats...", SCRW / 2, SCRH - 20, 2);
    tft->setTextDatum(TL_DATUM);
    if (fwStatsFetchOnline(s) && s.valid) fwStatsWriteSD(s); // online is authoritative
  }
  if (!s.valid) fwStatsReadSD(s);           // offline / fetch failed → SD copy
  if (!s.valid) return;                     // brand-new player → keep spawn defaults
  p->level      = s.level;
  p->xp         = s.xp;
  p->health     = s.health;
  p->max_health = s.max_health;
  p->strength   = s.strength;
}

// Capture the player's current progression into s.
static bool fwCaptureStats(Level *level, FWStats &s) {
  Entity *p = fwFindPlayer(level);
  if (!p) return false;
  s.name       = credGet("user").length() ? credGet("user") : String("Player");
  s.level      = p->level;
  s.xp         = p->xp;
  s.health     = p->health;
  s.max_health = p->max_health;
  s.strength   = p->strength;
  s.valid      = true;
  return true;
}

// Is `local` a legit progression from the server copy? Rejects regressions AND
// implausible jumps: XP and level may only go up, and the XP gain can't exceed
// maxGain — the most the maps actually played this run could yield (anti-cheat that
// still passes a real full campaign).
static bool fwStatsPlausible(const FWStats &local, const FWStats &server, float maxGain) {
  if (!local.valid || !server.valid) return false;
  if (local.xp != local.xp) return false;                 // NaN
  if (local.level < 1 || local.xp < 0) return false;
  if (local.xp + 0.5f < server.xp) return false;          // no XP regression
  if (local.level + 0.5f < server.level) return false;    // no level regression
  if (local.xp - server.xp > maxGain + 1.0f) return false; // more than the maps could give
  return true;
}

// On exit: pull the server's CURRENT stats, verify our progress is legit (gained no
// more than the played maps could yield), then push. Keeps SD consistent either way.
// Returns true only if we actually synced up.
static bool flipWorldStatsSyncOnline(const FWStats &local, float maxGain) {
  if (!local.valid || !fwOnline()) return false;
  FWStats srv; srv.valid = false;
  if (!(fwStatsFetchOnline(srv) && srv.valid)) return false; // can't verify → don't push
  if (fwStatsPlausible(local, srv, maxGain)) {
    fwStatsPushOnline(local);   // legit progression → sync up
    fwStatsWriteSD(local);
    return true;
  }
  // Server is ahead of us (e.g. another device advanced) or our stats look wrong —
  // adopt the server's authoritative copy locally and DON'T push a regression.
  fwStatsWriteSD(srv);
  return false;
}

// Controls splash — shown until the player taps (or a 15 s timeout).
static void flipWorldIntro() {
  tft->fillScreen(COL_BG);
  drawHeader("How to Play", false);
  tft->setTextDatum(MC_DATUM);
  tft->setTextColor(COL_FG, COL_BG);
  int cy = SCRH / 2;
  tft->drawString("Hold an edge to move",         SCRW / 2, cy - 44, 2);
  tft->drawString("Hold a corner for diagonals",  SCRW / 2, cy - 24, 2);
  tft->drawString("Tap the centre to attack",     SCRW / 2, cy - 4,  2);
  tft->drawString("Clear the map of foes to win", SCRW / 2, cy + 12, 2);
  tft->drawString("Tap < Back to quit",           SCRW / 2, cy + 36, 2);
  tft->setTextColor(COL_FG, COL_BG);
  tft->drawString("Tap to begin",                SCRW / 2, cy + 66, 4);
  tft->setTextDatum(TL_DATUM);

  InputManager *im = vm->getInputManager();
  TouchInput   *t  = im->getTouch();
  im->reset(true, 200);                    // swallow the tap that opened this screen
  uint32_t t0 = millis();
  bool wasDown = t && t->isPressed();
  while (millis() - t0 < 15000) {
    im->run();
    bool down = t && t->isPressed();
    if (down && !wasDown) break;           // fresh tap → start
    wasDown = down;
    delay(15);
  }
  im->reset(true, 250);
}

// The three worlds, played in order (like the Flipper build's LevelHomeWoods /
// LevelRockWorld / LevelForestWorld). All three are built up front as levels of
// one Game and share a single player entity; game->level_switch() moves between
// them. The reference only switches levels over multiplayer, so for single-player
// we advance when every enemy in the current world has been defeated.
static const int   FW_WORLD_COUNT = 24;
static const char *FW_WORLD_NAMES[FW_WORLD_COUNT] = {
  "Home Woods",   "Rock World",   "Forest Glade",   "Meadow",
  "Stronghold",   "Lakeside",     "Boulder Field",  "Village",
  "Deep Woods",   "Wasteland",    "Flower Garden",  "Shadow Keep",
  "Twin Peaks",   "Marshland",    "Ruins",          "Sunflower Fields",
  "Frozen Lake",  "The Hollow",   "Crossroads",     "Crater",
  "Enchanted Grove","Ironhold",   "Serpent Marsh",  "Dragon's Lair" };
static const char *FW_WORLD_JSON[FW_WORLD_COUNT] = {
  world_01, world_02, world_03, world_04, world_05, world_06,
  world_07, world_08, world_09, world_10, world_11, world_12,
  world_13, world_14, world_15, world_16, world_17, world_18,
  world_19, world_20, world_21, world_22, world_23, world_24 };

// Max XP each map can legitimately yield (worst case: level-1 player, most hits per
// enemy = ceil(health/10) * enemy strength). Summed over the maps actually played
// this run, it caps how much XP a sync may add — so a real full campaign passes but
// an impossible jump is rejected. Regenerate with the tools/ script if enemies change.
static const long FW_MAP_MAXXP[FW_WORLD_COUNT] = {
  1100, 1422, 1400, 1716, 2440, 2342, 2720, 3088, 4420, 4306, 5230, 6032,
  5378, 5674, 5824, 5824, 7718, 8116, 7828, 8374, 10670, 11538, 11702, 17200 };
  // ^ last map (Dragon's Lair) includes the boss dragon: 1000hp / 10 str-per-hit
  //   * 30 xp = ~3000 extra obtainable XP on top of the 8 regular foes (~14090).

// Map-unlock progress (SPIFFS /flipworld_progress.json). "unlocked" = how many maps
// are playable (>= 1). Clearing a map unlocks the next; the count never regresses.
static const char *FW_PROGRESS_FILE = "/flipworld_progress.json";
static int fwUnlockedCount() {
  File f = SPIFFS.open(FW_PROGRESS_FILE, FILE_READ);
  if (!f) return 1;
  JsonDocument d;
  DeserializationError e = deserializeJson(d, f);
  f.close();
  if (e) return 1;
  int n = d["unlocked"] | 1;
  if (n < 1) n = 1;
  if (n > FW_WORLD_COUNT) n = FW_WORLD_COUNT;
  return n;
}
static void fwSetUnlockedCount(int n) {
  if (n < 1) n = 1;
  if (n > FW_WORLD_COUNT) n = FW_WORLD_COUNT;
  if (n <= fwUnlockedCount()) return;   // never regress
  JsonDocument d;
  d["unlocked"] = n;
  File f = SPIFFS.open(FW_PROGRESS_FILE, FILE_WRITE);
  if (!f) return;
  serializeJson(d, f);
  f.close();
}

