H4W9/ESP32_FlipWorld/ESP32_FlipWorld.ino
// In-game floating health-bar visibility (toggled by tapping the HUD's HP line),
// persisted on SPIFFS.
static const char *FW_UI_FILE = "/flipworld_ui.json";
static bool fwHealthBarLoad() {
  File f = SPIFFS.open(FW_UI_FILE, FILE_READ);
  if (!f) return true;                 // default: shown
  JsonDocument d;
  DeserializationError e = deserializeJson(d, f);
  f.close();
  if (e) return true;
  return d["healthBar"] | true;
}
static void fwHealthBarSave(bool on) {
  JsonDocument d;
  d["healthBar"] = on;
  File f = SPIFFS.open(FW_UI_FILE, FILE_WRITE);
  if (!f) return;
  serializeJson(d, f);
  f.close();
}

// Count enemies still alive (not yet marked ENTITY_DEAD) in a level.
static int fwLivingEnemies(Level *level) {
  int n = 0;
  for (int i = 0; i < level->getEntityCount(); i++) {
    Entity *e = level->getEntity(i);
    if (e && e->type == ENTITY_ENEMY && e->state != ENTITY_DEAD) n++;
  }
  return n;
}

// Brief full-screen title card shown when a world is entered.
static void fwWorldBanner(int idx) {
  tft->fillScreen(COL_BG);
  drawHeader(FW_WORLD_NAMES[idx], true);
  tft->setTextDatum(MC_DATUM);
  tft->setTextColor(COL_DIM, COL_BG);
  char sub[24]; snprintf(sub, sizeof(sub), "Map %d of %d", idx + 1, FW_WORLD_COUNT);
  tft->drawString(sub, SCRW / 2, SCRH / 2 - 16, 2);
  tft->setTextColor(COL_FG, COL_BG);
  tft->drawString(FW_WORLD_NAMES[idx], SCRW / 2, SCRH / 2 + 12, 4);
  tft->setTextDatum(TL_DATUM);
  delay(1200);
}

// In-game header, drawn onto the off-screen canvas each frame (so it's part of the
// single swap() push — no flicker, never fought over by the game). A tap in the
// top-left "< Back" box (see backTapped) exits.
static void fwCanvasHeader(TFT_eSprite *g, const char *worldName) {
  if (!g) return;
  g->fillRect(0, 0, SCRW, HDRH, COL_ACCENT);

  // Back button — identical to the menus' (outlined rounded box + left chevron); its
  // tap region matches backTapped (top-left).
  g->drawRoundRect(2, 3, 40, 22, 4, theme.neon(3, COL_DIM));
  { int cx = 22, cy = 14; g->fillTriangle(cx + 3, cy - 5, cx + 3, cy + 5, cx - 4, cy, COL_FG); }

  // Title (centred).
  g->setTextColor(COL_FG, COL_ACCENT);
  g->setTextDatum(MC_DATUM);
  g->drawString(worldName, SCRW / 2, HDRH / 2, 2);

  // Status corner — the exact same battery % + WiFi arc icon the menus draw.
  drawStatusCorner(g);
  g->setTextDatum(TL_DATUM);
}

// Mini-map in the top-right: whole level scaled down, with the current camera view
// box, the player (blue) and living enemies (red). Drawn onto the canvas each frame.
static void fwDrawMinimap(TFT_eSprite *g, Level *level, Game *game) {
  if (!g || !level || game->current_level == nullptr) return;
  float worldW = level->size.x, worldH = level->size.y;
  if (worldW <= 0 || worldH <= 0) return;

  const int mmW = 64, mmH = 32;                 // 2:1, matches the 768x384 worlds
  const int mmX = SCRW - mmW - 4, mmY = HDRH + 3;
  float sx = mmW / worldW, sy = mmH / worldH;

  g->fillRect(mmX, mmY, mmW, mmH, TFT_BLACK);
  g->drawRect(mmX, mmY, mmW, mmH, 0x7BEF);      // grey frame

  // current camera view box
  int vx = mmX + (int)(game->pos.x * sx);
  int vy = mmY + (int)(game->pos.y * sy);
  int vw = (int)(game->size.x * sx), vh = (int)(game->size.y * sy);
  if (vx < mmX) { vw -= (mmX - vx); vx = mmX; }
  if (vy < mmY) { vh -= (mmY - vy); vy = mmY; }
  if (vw > mmW - (vx - mmX)) vw = mmW - (vx - mmX);
  if (vh > mmH - (vy - mmY)) vh = mmH - (vy - mmY);
  if (vw > 0 && vh > 0) g->drawRect(vx, vy, vw, vh, 0x39C7); // dim view box

  // Entities are added scenery-first, then enemies, then the player, so iterating in
  // order draws world objects underneath and the player on top.
  for (int i = 0; i < level->getEntityCount(); i++) {
    Entity *e = level->getEntity(i);
    if (!e || !e->is_active) continue;
    uint16_t col;
    int r;
    if (e->is_player) { col = 0x1C9F; r = 2; }                                    // blue player
    else if (e->type == ENTITY_ENEMY) {
      if (e->state == ENTITY_DEAD) continue;
      if (e->size.x >= 40) { col = 0xFD20; r = 4; }  // the boss dragon — big orange blip
      else { col = 0xF800; r = 1; }                  // ordinary red foe
    }
    else if (e->type == ENTITY_ICON) { col = e->ink_color; r = 0; }               // world object, its own colour
    else continue;
    int dx = mmX + (int)(e->position.x * sx);
    int dy = mmY + (int)(e->position.y * sy);
    if (dx < mmX) dx = mmX; if (dx > mmX + mmW - r - 1) dx = mmX + mmW - r - 1;
    if (dy < mmY) dy = mmY; if (dy > mmY + mmH - r - 1) dy = mmY + mmH - r - 1;
    g->fillRect(dx, dy, r + 1, r + 1, col);
  }
}

// Centred message screen (used for save/sync + cleared/unlock notices).
static void fwNotice(const String &line1, const String &line2, uint32_t holdMs) {
  tft->fillScreen(COL_BG);
  drawHeader("FlipWorld", false);
  tft->setTextDatum(MC_DATUM);
  tft->setTextColor(COL_FG, COL_BG);
  tft->drawString(line1, SCRW / 2, SCRH / 2 - (line2.length() ? 12 : 0), 2);
  if (line2.length()) tft->drawString(line2, SCRW / 2, SCRH / 2 + 12, 2);
  tft->setTextDatum(TL_DATUM);
  if (holdMs) delay(holdMs);
}

// Play maps starting at startIndex. In campaign mode, clearing a map advances to the
// next automatically (carrying progression) until the player exits or beats the last
// map. In single-map mode (campaign=false) it plays just the one map and returns.
// Clearing a map always unlocks the next. Stats save to SD (and sync online) on exit.
static void playMaps(int startIndex, bool campaign) {
  if (startIndex < 0 || startIndex >= FW_WORLD_COUNT) return;
  flipWorldIntro();

  Board board = vm->getBoard();
  Draw         *draw   = vm->getDraw();
  TFT_eSprite  *canvas = draw->display->getCanvas();
  InputManager *im     = vm->getInputManager();
  TouchInput   *t      = im->getTouch();

  int  mapIndex   = startIndex;
  bool campaignWin = false;
  FWStats runStats; runStats.valid = false;   // latest progression, synced once on exit
  float xpBudget = 0;                          // max XP the maps played this run can yield

  // Restore the health-bar visibility the player last chose (tap-toggle in-game).
  bool healthBar = fwHealthBarLoad();
  FlipWorld::fw_set_health_bar(healthBar);

