H4W9/ESP32_FlipWorld/ESP32_FlipWorld.ino
  for (;;) {
    xpBudget += FW_MAP_MAXXP[mapIndex];        // account for the map about to be played
    Game *game = new Game(
        "FlipWorld", Vector(board.width, board.height),
        vm->getDraw(), vm->getInputManager(),
        TFT_WHITE, FW_WORLD_BG, CAMERA_FIRST_PERSON, nullptr, FlipWorld::game_stop);

    Level *level = new Level(FW_WORLD_NAMES[mapIndex], Vector(768, 384), game, NULL, NULL);
    game->level_add(level);
    FlipWorld::icon_spawn_json(level, FW_WORLD_JSON[mapIndex]);
    FlipWorld::enemy_spawn_json(level, FW_WORLD_JSON[mapIndex]);
    // Cameo dragon fly-bys (undefeated): burn targets on 1 pass, or strafe the player
    // over 2 passes, then leave.
    static const float VILLAGE_HOUSE[] = {584, 56};
    static const float MEADOW_TREES[]  = {680, 60, 680, 130}; // two trees on the column
    if (mapIndex == 3)  FlipWorld::flyby_dragon_spawn(level, 1, 1, MEADOW_TREES, 2);   // Meadow: 2 trees
    else if (mapIndex == 7)  FlipWorld::flyby_dragon_spawn(level, 1, 1, VILLAGE_HOUSE, 1); // Village: a house
    else if (mapIndex == 11 || mapIndex == 14 || mapIndex == 19 || mapIndex == 22)
        FlipWorld::flyby_dragon_spawn(level, 2, 0, nullptr, 0); // Shadow Keep/Ruins/Crater/Serpent Marsh
    if (mapIndex == FW_WORLD_COUNT - 1) FlipWorld::dragon_spawn(level); // boss in the last world

    FlipWorld::player_spawn(level, "sword", Vector(384, 192));
    FlipWorld::set_player_name(credGet("user").c_str());   // "" → "Player" (offline/guest)
    Entity *player = fwFindPlayer(level);

    // Pull online stats only for the first map of the run; later campaign maps read
    // the SD copy the previous map just wrote (progression carries, no re-sync/lag).
    flipWorldStatsApply(level, mapIndex == startIndex);

    game->pos     = Vector(384, 192);
    game->old_pos = game->pos;
    game->level_switch(0);

    GameEngine *engine = new GameEngine(game, 60);

    // Double-buffered render loop: clear canvas → draw world + header → swap.
    bool exiting = false, cleared = false;
    fwWorldBanner(mapIndex);
    while (!exiting) {
      im->run();
      if (t && t->isPressed() && backTapped(t->x(), t->y())) { exiting = true; break; }
      draw->clear(Vector(0, 0), Vector(SCRW, SCRH), FW_WORLD_BG);
      engine->runAsync(false);
      fwCanvasHeader(canvas, FW_WORLD_NAMES[mapIndex]);
      fwDrawMinimap(canvas, level, game);
      draw->swap();
      // Persist the health-bar toggle the moment the player flips it in-game.
      if (FlipWorld::fw_get_health_bar() != healthBar) {
        healthBar = FlipWorld::fw_get_health_bar();
        fwHealthBarSave(healthBar);
      }
      if (fwLivingEnemies(level) == 0) { cleared = true; exiting = true; break; }
      delay(1);   // minimal yield (WDT); the swap() push already paces the frame rate
    }

    // Capture the latest progression and keep the local SD copy up to date before
    // teardown. The online sync (pull → verify → push) happens once, on the way out.
    fwCaptureStats(level, runStats);
    if (runStats.valid) fwStatsWriteSD(runStats);
    if (cleared) fwSetUnlockedCount(mapIndex + 2);   // unlock the next map

    engine->stop();
    delete engine;
    if (player) delete player;   // Level::clear skipped is_player; free it here

    // Advance in campaign, else finish this run.
    if (cleared && campaign && mapIndex + 1 < FW_WORLD_COUNT) {
      fwNotice(String(FW_WORLD_NAMES[mapIndex]) + " cleared!",
               String("Next: ") + FW_WORLD_NAMES[mapIndex + 1], 1800);
      mapIndex++;
      continue;
    }
    if (cleared && mapIndex + 1 >= FW_WORLD_COUNT) campaignWin = true;
    else if (cleared)
      fwNotice(String(FW_WORLD_NAMES[mapIndex]) + " cleared!",
               String("Unlocked: ") + FW_WORLD_NAMES[mapIndex + 1], 2200);
    break;
  }

  if (campaignWin) fwNotice("All maps cleared!", "You beat FlipWorld!", 2800);

  // Online sync on the way out: pull the server's current stats, verify our progress
  // is a legit improvement, then push. (Prevents regressions and cheated jumps.)
  bool synced = false;
  if (runStats.valid && fwOnline()) {
    fwNotice("Syncing stats...", "", 0);
    synced = flipWorldStatsSyncOnline(runStats, xpBudget);
  }
  fwNotice(synced ? "Stats saved & synced online" : "Stats saved to SD", "", 1600);

  im->reset(true, 200);
}

// Map-select screen: lists all maps; locked ones can't be entered. Returns the
// chosen (unlocked) map index, or -1 on Back.
// Campaign start chooser: Continue from the furthest map reached, or start over from
// Map 1. Returns the map index to start at, or -1 on Back. With no progress yet it
// just returns 0 (Map 1) without prompting.
static int fwCampaignStart() {
  int unlocked = fwUnlockedCount();
  if (unlocked <= 1) return 0;                 // nothing to continue → start at Map 1
  int resumeIdx = unlocked - 1;                // highest unlocked = furthest reached
  String rows[2];
  rows[0] = String("Continue - ") + FW_WORLD_NAMES[resumeIdx];
  rows[1] = "New Campaign (Map 1)";
  int sel = scrollList("Campaign", rows, 2, true, "Back", "", "");
  if (sel == 0) return resumeIdx;
  if (sel == 1) return 0;
  return -1;                                   // Back
}

static int fwMapPicker() {
  String rows[FW_WORLD_COUNT];
  for (;;) {
    int unlocked = fwUnlockedCount();
    for (int i = 0; i < FW_WORLD_COUNT; i++) {
      rows[i] = String(i + 1) + ". " + FW_WORLD_NAMES[i] + (i < unlocked ? "" : "  (Locked)");
    }
    int sel = scrollList("Select Map", rows, FW_WORLD_COUNT, true, "Back", "", "");
    if (sel == SL_BACK || sel == SL_F0) return -1;
    if (sel >= 0 && sel < FW_WORLD_COUNT) {
      if (sel < unlocked) return sel;
      msgScreen("Locked", "Clear earlier maps first", "to unlock this one.", COL_DIM);
    }
  }
}

// Main menu (H4W9-style large rounded buttons)
static const char *MENU_ITEMS[] = { "Campaign", "Select Map", "Settings" };
static const int    MENU_COUNT  = 3;
static const int    MENU_MARGIN = 16;
static const int    MENU_TOP    = CONTENTY + 12;
static const int    MENU_GAP    = 12;
static int menuBtnH() {
  int avail = SCRH - MENU_TOP - 12;
  return (avail - (MENU_COUNT - 1) * MENU_GAP) / MENU_COUNT;
}
static int menuBtnY(int i) { return MENU_TOP + i * (menuBtnH() + MENU_GAP); }
static int menuButtonAt(uint16_t x, uint16_t y) {
  if ((int)x < MENU_MARGIN || (int)x >= SCRW - MENU_MARGIN) return -1;
  int bh = menuBtnH();
  for (int i = 0; i < MENU_COUNT; i++) {
    int by = menuBtnY(i);
    if ((int)y >= by && (int)y < by + bh) return i;
  }
  return -1;
}

static void drawMenu() {
  tft->fillScreen(COL_BG);
  drawHeader("FlipWorld", false);
  int bh = menuBtnH();
  for (int i = 0; i < MENU_COUNT; i++) {
    int y = menuBtnY(i);
    tft->fillRoundRect(MENU_MARGIN, y, SCRW - 2 * MENU_MARGIN, bh, 12, COL_ACCENT);
    tft->drawRoundRect(MENU_MARGIN, y, SCRW - 2 * MENU_MARGIN, bh, 12, theme.neon(i * 3, COL_DIM));
    tft->setTextColor(COL_FG, COL_ACCENT);
    tft->setTextDatum(MC_DATUM);
    // V8's buttons are ~34 px tall — font 4 (26 px) crowds them, so use font 2.
#ifdef MARAUDER_V8
    tft->drawString(MENU_ITEMS[i], SCRW / 2, y + bh / 2, 2);
#else
    tft->drawString(MENU_ITEMS[i], SCRW / 2, y + bh / 2, 4);
#endif
  }
  tft->setTextDatum(TL_DATUM);
}

static void openMenuItem(int i) {
  switch (i) {
    case 0: { int s = fwCampaignStart(); if (s >= 0) playMaps(s, true); } break; // Campaign (continue / new)
    case 1:                            // Select Map — pick a map, play it, back to picker
      for (;;) { int m = fwMapPicker(); if (m < 0) break; playMaps(m, false); }
      break;
    case 2: settingsFlow(); break;     // WiFi, theme, brightness, About
    default: break;
  }
  drawMenu();
}

static bool mainMenuStart(ViewManager *viewManager) {
  drawMenu();
  return true;
}

